Revit 2027 API
RebarInSystem.Quantity Property
 Identifies the number of bars in rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Quantity { get; }
Public ReadOnly Property Quantity As Integer
	Get
public:
property int Quantity {
	int get ();
}
member Quantity : int with get
Property Value
Int32
Remarks
 Quantity is equal to NumberOfBarPositions if all the bars are included. If any bars are excluded, they are not counted in the Quantity.
See Also
Reference
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace